#1) Пользователь вводит строку.
#1.1 Сначала выведите третий символ этой строки.
#1.2 Во второй строке выведите предпоследний символ этой строки.
#1.3 В третьей строке выведите первые пять символов этой строки.
#1.4 В четвертой строке выведите всю строку, кроме последних двух символов.
#1.5 В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
#1.6 В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
#1.7 В седьмой строке выведите все символы в обратном порядке.
#1.8 В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
#1.9 В девятой строке выведите длину данной строки.

#2) Пользователь вводит две строки. Необходимо определить, являются ли две строки анаграммами. Анаграмма — это слова состоящие из одних и тех же букв, расположенных в разном порядке.

#3) Пользователь вводит строку и символ. Определить количество вхождений символа в строку, независимо от регистра.

#4) Пользователь вводит  строку и символ. Необходимо определить индексы первого и последнего вхождения символа в строке. 

#5) Пользователь вводит строку.
#Необходимо определить, являются ли строка палиндромом, также учитывать, что строка помимо букв, может содержать пробел, тире, запятую, точку, восклицательный и вопросительный знак.
#Палиндром — слово или текст, одинаково читающееся в обоих направлениях.
