#1) Пользователь вводит строку и символ.
# Определить количество вхождений символа в строку, независимо от регистра,
# при этом нельзя использовать метод count.
_str = input('введите тестовую строку:')
_symbol = input('введите искомый символ:')
_count = 0
for i in _str:
    if i == _symbol:
        _count +=1
print('количество вхождений символа в строку',_count)
#2) Пользователь вводит  строку и символ.
# Необходимо определить индексы первого и последнего вхождения символа в строке,
# при этом нельзя использовать строковые методы для поиска.
_str2 = input('введите тестовую строку:')
_symbol = input('введите искомый символ:')
_ind = i
for i in _str2:
      i +=1
        print(_ind)




